tutorials/pM4F-Benchmarks/case8/structuredMesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          394;
        startFace       19800;
    }
    inlet
    {
        type            patch;
        nFaces          3;
        startFace       20194;
    }
    outlet
    {
        type            patch;
        nFaces          3;
        startFace       20197;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
