tutorials/pM4F-Benchmarks/case8/structuredMesh/constant/test.phr
#DATABASE c:\phreeqc\database\JenaFin.DAT

SOLUTION 0						#Inlet data for the problem
        -temp 25
        -pH 5.5				#Not given
        -units mmol/kgw
#       pe 14
#	Concentrations from Table 5
	Ba 300 charge
	Cl 600
	Sr 1e-6
	C(4) 1.5910872e-2
	S(6) 1e-6
#?	H2 0
#?	O2 0.0002
#EQUILIBRIUM_PHASES 0 Do we need this as initially there is no mineral present
END


SOLUTION 1
        -temp 25
        -pH 5.61				#Paper data = 5.6 (adjusted according to H+ concentration -> -log(H+))
        -units mmol/kgw
#        pe 14
	Ba 1.00002404e-06 #charge
	Cl 2e-6
	Sr 1.000037846e-6 
	C(4) 0.015950046 charge
	S(6) 1.000239697e-6
#	SAVE SOLUTION 1
#	SAVE SOLUTION 3
END

SOLUTION 2 
        -temp 25
        -pH 5.62				#Paper data = 5.6 (adjusted according to H+ concentration -> -log(H+))								
        -units mmol/kgw
#        pe 14
	Ba 1.000016927e-06
	Cl 2e-6
	Sr 0.644419425 Celestite_SmlGrns 0
	C(4) 0.016039475
	S(6) 0.644518163
KINETICS
Celestite_SmlGrns
        -m      29.31                                                                                                           
	-m0     29.31                                                                                                           
	-parms  20000
Celestite_LrgGrns
        -m      14.66                                                                                                           
	-m0     14.66                                                                                                           
	-parms  100
END

SOLUTION 3
        -temp 25
        -pH 5.61                                #Paper data = 5.6 (adjusted according to H+ concentration -> -log(H+))
        -units mmol/kgw
#        pe 14
        Ba 1.00002404e-06 #charge
        Cl 2e-6
        Sr 1.000037846e-6
        C(4) 0.015950046 charge
        S(6) 1.000239697e-6
#       SAVE SOLUTION 1
#       SAVE SOLUTION 3
END
