tutorials/pM4F-Benchmarks/case8/structuredMesh/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
mu              mu [ 1 -1 -1 0 0 0 0 ] 1e-3;
rho              rho [ 1 -3 0 0 0 0 0 ] 1000;

geochemicalProperties
{
 geochemicalModel phreeqcRM;

 mineral (Witherite BaCl2 BaCl22H2O BaCl2H2O Barite Strontianite SrCl2 SrCl22H2O SrCl26H2O Celestite_SmlGrns Celestite_LrgGrns);

 absolutePermeabilityModel KozenyCarman;
 KozenyCarmanCoeffs
 {
	updateFromInitialPoroPerm true;
	K0 K0 [0 2 0 0 0 0 0] 1.;
 }

 dispersionModel archiesLaw;
 archiesLawCoeffs 
 {
        Di              Di  [0 2 -1 0 0 0 0] 1e-9;
	alphaL		alphaL [0 1 0 0 0 0 0] 1e-5;
	n 0;
	addDispersion true;
 }


 WitheriteProperties
 {
	activatePhaseEquilibrium true;
	rhos rhos [1 -3 0 0 0 0 0] 4880;
	Vm Vm [0 3 0 0 -1 0 0] 40.40e-6;

  surfaceAreaModel none;
 }

 BaCl2Properties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 3856;	//wiki - anhydrous
  Vm Vm [0 3 0 0 -1 0 0] 54.00e-6;	
  //calc - 208.23 (g/mol)/3.856 (g/cm3)

  surfaceAreaModel none;
 }

 BaCl22H2OProperties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 3097.9;      //wiki - dihydrate
  Vm Vm [0 3 0 0 -1 0 0] 78.85e-6;      
  //calc - 244.26 (g/mol)/3.0979 (g/cm3)

  surfaceAreaModel none;
 }

 BaCl2H2OProperties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 3320;      
  //https://materials.springer.com/isp/crystallographic/docs/sd_2080254
  Vm Vm [0 3 0 0 -1 0 0] 68.15e-6;
  //calc - 226.24836 (g/mol)/3.32 (g/cm3)

  surfaceAreaModel none;
 }

 BariteProperties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 4480;
  //https://en.wikipedia.org/wiki/Baryte
  Vm Vm [0 3 0 0 -1 0 0] 52.09e-6;
  //calc - 233.38 (g/mol)/4.48 (g/cm3)

  surfaceAreaModel none;
 }

 StrontianiteProperties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 3780;
  //http://webmineral.com/data/Strontianite.shtml
  Vm Vm [0 3 0 0 -1 0 0] 39.06e-6;
  //calc - 147.63 (g/mol)/3.78 (g/cm3)

  surfaceAreaModel none;
 }

 SrCl2Properties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 3052;
  //https://en.wikipedia.org/wiki/Strontium_chloride
  Vm Vm [0 3 0 0 -1 0 0] 51.94e-6;
  //calc - 158.53 (g/mol)/3.052 (g/cm3)

  surfaceAreaModel none;
 }

 SrCl22H2OProperties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 2672;
  //https://en.wikipedia.org/wiki/Strontium_chloride
  Vm Vm [0 3 0 0 -1 0 0] 72.81e-6;
  //calc - 194.56 (g/mol)/2.672 (g/cm3)

  surfaceAreaModel none;
 }

 SrCl26H2OProperties
 {
  activatePhaseEquilibrium true;
  rhos rhos [1 -3 0 0 0 0 0] 1930;
  //https://en.wikipedia.org/wiki/Strontium_chloride
  Vm Vm [0 3 0 0 -1 0 0] 138.15e-6;
  //calc - 266.62 (g/mol)/1.93 (g/cm3)

  surfaceAreaModel none;
 }

 Celestite_SmlGrnsProperties
 {
  activatePhaseEquilibrium false;
  rhos rhos [1 -3 0 0 0 0 0] 1930;
  //https://en.wikipedia.org/wiki/Strontium_sulfate
  Vm Vm [0 3 0 0 -1 0 0] 46.38e-6;
  //calc - 183.68 (g/mol)/3.96 (g/cm3)

  surfaceAreaModel mingliangLaw;
  mingliangLawCoeffs
  {
   A0 A0 [0 -1 0 0 0 0 0] 20000.;
   n 1.;
   initVF 0.223;
  }

 }

 Celestite_LrgGrnsProperties
 {
  activatePhaseEquilibrium false;
  rhos rhos [1 -3 0 0 0 0 0] 1930;
  //https://en.wikipedia.org/wiki/Strontium_sulfate
  Vm Vm [0 3 0 0 -1 0 0] 46.38e-6;
  //calc - 183.68 (g/mol)/3.96 (g/cm3)

  surfaceAreaModel mingliangLaw;
  mingliangLawCoeffs
  {
   A0 A0 [0 -1 0 0 0 0 0] 100.;
   n 1.;
   initVF 0.447;
  }

 }


phreeqcRM
{
        PhreeqcInputFile "test.phr";	//"jena.phr"; 
        PhreeqcDataBase  "JenaFin.DAT";

        activateUpdatePorosity true;

	numThreads 2;
	use_cvODE true;
}

}

// ************************************************************************* //
