tutorials/pM4F-Benchmarks/case8/structuredMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.1 0 0)
    (0 0.008 0)
    (0.1 0.008 0)
    (0 0.011 0)
    (0.1 0.011 0)
    (0 0.089 0)
    (0.1 0.089 0)
    (0 0.092 0)
    (0.1 0.092 0)
    (0 0.1 0)
    (0.1 0.1 0)

    (0 0 0.01)
    (0.1 0 0.01)
    (0 0.008 0.01)
    (0.1 0.008 0.01)
    (0 0.011 0.01)
    (0.1 0.011 0.01)
    (0 0.089 0.01)
    (0.1 0.089 0.01)
    (0 0.092 0.01)
    (0.1 0.092 0.01)
    (0 0.1 0.01)
    (0.1 0.1 0.01)
);

blocks
(
    hex (0 1 3 2 12 13 15 14) (100 8 1) simpleGrading (1 1 1)
    hex (2 3 5 4 14 15 17 16) (100 3 1) simpleGrading (1 1 1)
    hex (4 5 7 6 16 17 19 18) (100 78 1) simpleGrading (1 1 1)
    hex (6 7 9 8 18 19 21 20) (100 3 1) simpleGrading (1 1 1)
    hex (8 9 11 10 20 21 23 22) (100 8 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (11 10 22 23)	//topWall
	    (0 1 13 12)		//bottomWall
            (10 8 20 22)	//leftWall
            (8 6 18 20)
            (6 4 16 18)
            (2 0 12 14)
            (1 3 15 13)		//rightWall
            (3 5 17 15)
            (5 7 19 17)
            (9 11 23 21)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (4 2 14 16)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (7 9 21 19)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (11 9 8 10)
	    (9 7 6 8)
	    (7 5 4 6)
	    (5 3 2 4)
	    (3 1 0 2)
            (13 15 14 12)
	    (15 17 16 14)
	    (17 19 18 16)
	    (19 21 20 18)
	    (21 23 22 20)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
