tutorials/pM4F-Benchmarks/case8/structuredMesh/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue inertMineral 0.
    volScalarFieldValue Ys.Celestite_SmlGrns 0.
    volScalarFieldValue Ys.Celestite_LrgGrns 0.
    
    volScalarFieldValue K 0.

    volScalarFieldValue linkDomainZonesToPhreeqcSol 1
);

regions
(
    boxToCell
    {
        box (0 0 -1) (0.045 0.1 1);
        fieldValues
        (
            volScalarFieldValue inertMineral 0.66
        );
    }

    boxToCell
    {
        box (0.055 0 -1) (1. 0.1 1);
        fieldValues
        (
            volScalarFieldValue inertMineral 0.6
        );
    }

    boxToCell
    {
        box (0.045 0 -1) (0.055 0.1 1);
        fieldValues
        (
            volScalarFieldValue Ys.Celestite_SmlGrns 0.223
        );
    }

    boxToCell
    {
        box (0.045 0 -1) (0.055 0.1 1);
        fieldValues
        (
            volScalarFieldValue Ys.Celestite_LrgGrns 0.447
        );
    }

    boxToCell
    {
        box (0. 0 -1) (0.045 0.1 1);
        fieldValues
        (
            volScalarFieldValue K 1.82e-11
        );
    }

    boxToCell
    {
        box (0.045 0 -1) (0.055 0.1 1);
        fieldValues
        (
            volScalarFieldValue K 1.8e-14
        );
    }

    boxToCell
    {
        box (0.055 0 -1) (0.1 0.1 1);
        fieldValues
        (
            volScalarFieldValue K 1.82e-11
        );
    }

    boxToCell
    {
        box (0. 0 -1) (0.045 0.1 1);
        fieldValues
        (
            volScalarFieldValue linkDomainZonesToPhreeqcSol 1
        );
    }

    boxToCell
    {
        box (0.045 0 -1) (0.055 0.1 1);
        fieldValues
        (
            volScalarFieldValue linkDomainZonesToPhreeqcSol 2
        );
    }

    boxToCell
    {
        box (0.055 0 -1) (0.1 0.1 1);
        fieldValues
        (
            volScalarFieldValue linkDomainZonesToPhreeqcSol 3
        );
    }

);

// ************************************************************************* //
